bench/trimbench/res.ext4.discard.noraid.1crucial.linux65.socket2/o.test.out
nohup: ignoring input
Create /data/m/f.1 at Wed Jun 19 04:00:21 AM UTC 2024
1048576+0 records in
1048576+0 records out
1099511627776 bytes (1.1 TB, 1.0 TiB) copied, 3699.75 s, 297 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 1.0T Jun 19 05:02 /data/m/f.1
Sleep for 30 seconds after creating /data/m/f.1 at Wed Jun 19 05:02:01 AM UTC 2024
Existing /data/m/f.2 is large enough
List kernel
Linux socket2 6.5.0-35-generic #35~22.04.1-Ubuntu SMP PREEMPT_DYNAMIC Tue May  7 09:00:52 UTC 2 x86_64 x86_64 x86_64 GNU/Linux
List mount options for filesystems
sysfs on /sys type sysfs (rw,nosuid,nodev,noexec,relatime)
proc on /proc type proc (rw,nosuid,nodev,noexec,relatime)
udev on /dev type devtmpfs (rw,nosuid,relatime,size=32720388k,nr_inodes=8180097,mode=755,inode64)
devpts on /dev/pts type devpts (rw,nosuid,noexec,relatime,gid=5,mode=620,ptmxmode=000)
tmpfs on /run type tmpfs (rw,nosuid,nodev,noexec,relatime,size=6557228k,mode=755,inode64)
efivarfs on /sys/firmware/efi/efivars type efivarfs (rw,nosuid,nodev,noexec,relatime)
/dev/sda2 on / type ext4 (rw,relatime)
securityfs on /sys/kernel/security type securityfs (rw,nosuid,nodev,noexec,relatime)
tmpfs on /dev/shm type tmpfs (rw,nosuid,nodev,inode64)
tmpfs on /run/lock type tmpfs (rw,nosuid,nodev,noexec,relatime,size=5120k,inode64)
cgroup2 on /sys/fs/cgroup type cgroup2 (rw,nosuid,nodev,noexec,relatime,nsdelegate,memory_recursiveprot)
pstore on /sys/fs/pstore type pstore (rw,nosuid,nodev,noexec,relatime)
bpf on /sys/fs/bpf type bpf (rw,nosuid,nodev,noexec,relatime,mode=700)
systemd-1 on /proc/sys/fs/binfmt_misc type autofs (rw,relatime,fd=29,pgrp=1,timeout=0,minproto=5,maxproto=5,direct,pipe_ino=20760)
hugetlbfs on /dev/hugepages type hugetlbfs (rw,relatime,pagesize=2M)
mqueue on /dev/mqueue type mqueue (rw,nosuid,nodev,noexec,relatime)
debugfs on /sys/kernel/debug type debugfs (rw,nosuid,nodev,noexec,relatime)
tracefs on /sys/kernel/tracing type tracefs (rw,nosuid,nodev,noexec,relatime)
fusectl on /sys/fs/fuse/connections type fusectl (rw,nosuid,nodev,noexec,relatime)
configfs on /sys/kernel/config type configfs (rw,nosuid,nodev,noexec,relatime)
ramfs on /run/credentials/systemd-sysusers.service type ramfs (ro,nosuid,nodev,noexec,relatime,mode=700)
/var/lib/snapd/snaps/core20_2264.snap on /snap/core20/2264 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/core20_2318.snap on /snap/core20/2318 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_27948.snap on /snap/lxd/27948 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_28373.snap on /snap/lxd/28373 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21759.snap on /snap/snapd/21759 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21465.snap on /snap/snapd/21465 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/dev/sdb on /data2 type ext4 (rw,noatime,nodiratime,discard)
/dev/sda1 on /boot/efi type vfat (rw,relatime,fmask=0022,dmask=0022,codepage=437,iocharset=iso8859-1,shortname=mixed,errors=remount-ro)
binfmt_misc on /proc/sys/fs/binfmt_misc type binfmt_misc (rw,nosuid,nodev,noexec,relatime)
tmpfs on /run/snapd/ns type tmpfs (rw,nosuid,nodev,noexec,relatime,size=6557228k,mode=755,inode64)
nsfs on /run/snapd/ns/lxd.mnt type nsfs (rw)
tmpfs on /run/user/1000 type tmpfs (rw,nosuid,nodev,relatime,size=6557224k,nr_inodes=1639306,mode=700,uid=1000,gid=1000,inode64)
/dev/nvme0n1 on /data type ext4 (rw,noatime,nodiratime,discard)

Remove /data/m/f.1 at Wed Jun 19 05:02:34 AM UTC 2024
Start fio to read from /data/m/f.2 at Wed Jun 19 05:02:34 AM UTC 2024

iops-test-job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process

iops-test-job: (groupid=0, jobs=1): err= 0: pid=1799174: Wed Jun 19 05:04:04 2024
  read: IOPS=75.8k, BW=296MiB/s (311MB/s)(26.0GiB/90001msec)
    slat (nsec): min=1415, max=23067k, avg=4375.12, stdev=8991.60
    clat (usec): min=9, max=25785, avg=99.85, stdev=203.99
     lat (usec): min=66, max=25792, avg=104.38, stdev=204.58
    clat percentiles (usec):
     |  1.00th=[   71],  5.00th=[   73], 10.00th=[   75], 20.00th=[   76],
     | 30.00th=[   78], 40.00th=[   79], 50.00th=[   80], 60.00th=[   82],
     | 70.00th=[   83], 80.00th=[   85], 90.00th=[   88], 95.00th=[   93],
     | 99.00th=[  163], 99.50th=[ 2008], 99.90th=[ 2073], 99.95th=[ 2212],
     | 99.99th=[ 2802]
   bw (  KiB/s): min=13632, max=416968, per=100.00%, avg=303347.40, stdev=138691.79, samples=179
   iops        : min= 3408, max=104242, avg=75836.82, stdev=34672.93, samples=179
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=96.15%, 250=2.88%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.40%, 4=0.57%, 10=0.01%, 50=0.01%
  cpu          : usr=17.33%, sys=41.39%, ctx=1952019, majf=0, minf=603
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6825375,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=296MiB/s (311MB/s), 296MiB/s-296MiB/s (311MB/s-311MB/s), io=26.0GiB (28.0GB), run=90001-90001msec

Disk stats (read/write):
  nvme0n1: ios=6816020/629, merge=0/16092, ticks=628922/1814, in_queue=647219, util=99.99%

run.sh: line 61: kill: (1799146) - No such process